var courseJson = [

    {
        "id": "0",
        "name": "",
        "description": "",
        "image": "",
        "price": "",
        "duration": "",
        "language": "",
        "location": "",   
        "frontEndTech": [],
        "backEndTech": [],
        "times": "",
        "requirements": []
    },

    {    
        "id": "1",
        "name": "Full Stack Web Developer",
        "description": "The CodeFactory Full Stack Web Developer training course prepares you for your versatile career as a Junior Web Developer. From back-end to front-end programming languages and frameworks you will learn how to use the most popular programs, such as Angular, PHP, WordPress, HTML, CSS and JavaScript. As a Full Stack Web Developer you have comprehensive knowledge in the area of software         development and are proficient in currently relevant programming languages. This allows you to work in both web and software development.        As a generalist you can perform almost any task with your coding skills and often work closely together with project managers by taking care of requirements management, software and test planning as well as programming activities.",
        "image": "./img/course/fullstack.jpg",
        "price": "3990",
        "duration": "15",
        "language": "English",
        "location": "CodeFactory, Kettenbrückengasse 23/2/12, 1050 Vienna",   
        "frontEndTech": 
            ["Version Control (Git - GitHub)",
            "HTML5","CSS3","JavaScript","jQuery",
            "Bootstrap","Project Documentation",
            "TypeScript","Angular 6.0"],
        "backEndTech": 
            ["SQL (MySQL)","SCRUM & Requirements Engineering"
            ,"PHP","AJAX","Symfony PHP framework",
            "WordPress","Software Testing",
            "Complementary skills"],
        "times": "Monday to Thursday 9-16 o’clock @ CodeFactory",
        "requirements": "They are motivated in the team and also to learn independently and to face new challenges. You either participated in our basic JavaScript and HTML & CSS courses, or even programmed the task from our beginner curriculum. After completing all the individual chapters of the course you are ready to start working as a fully qualified web developer.",
        "registrationLink":"https://codefactory.wien/en/registration-full-stack-web-developer-en/" 
    },
    {     
        "id": "2",
        "name": "Front End Developer ",
        "description": "Our full-stack training is structured in two parts and can be booked separately: The first part is the so-called “Frontend Developer” course. The core task of a frontend developer, and thus the goal of this course, is the design anddevelopment of the visual aspects of a web page for internet browsers or the design of app’s. Unlike the backend developer who creates the server-side programming of the website, as a front-end developer the focus is on implementing the layout and, increasingly, client-side programming in modern frameworks such as Angular.",
        "image": "./img/course/frontend.jpg",
        "price": "2499",
        "duration": "8",
        "language": "English",
        "location": "CodeFactory, Kettenbrückengasse 23/2/12, 1050 Vienna",   
        "frontEndTech": 
            ["Version Control (Git - GitHub)",
            "HTML5","CSS3","JavaScript","jQuery",
            "Bootstrap","Project Documentation",
            "TypeScript","Angular 6.0"],
        "backEndTech": 
            [],
        "times": "Monday to Thursday 9-16 o’clock @ CodeFactory",
        "requirements": "You are motivated and like to work in teams as well as want to learn new things. You either participated in our basic JavaScript and HTML & CSS courses, or even programmed the task from our beginner curriculum. After completing all the individual chapters of the course you are ready to start working as a fully qualified web developer.",
         "registrationLink":"https://codefactory.wien/en/registration-frontend-developer-en/" 
    },
     {     
        "id": "3",
        "name": "Back End Developer ",
        "description": "Our full-stack training is divided into two parts and can be booked separately: The second part is the so-called “Backend Developer” course. The core task of a backend developer is the development and maintenance of software and databases that ensure the smooth running of the server operation in the background. In other words, he takes care that the data and services requested by the client program are made available to them, e.g. in the frontend of an application or website.",
        "image": "./img/course/backend.jpg",
        "price": "2490",
        "duration": "7",
        "language": "English",
        "location": "CodeFactory, Kettenbrückengasse 23/2/12, 1050 Vienna",   
        "frontEndTech": 
            [],
        "backEndTech": 
            ["SQL",
                "SCRUM & Requirements Engineering","PHP","AJAX",
                "Symfony PHP framework","WordPress",
                " Software Testing","Complementary Skills"],
        "times": "Monday to Thursday 9-16 o’clock @ CodeFactory",
        "requirements": "You are motivated and like to work in teams as well as want to learn new things.You either participated in our basic JavaScript and HTML & CSS courses, or even programmed the task from our beginner curriculum. After completing all the individual chapters of the course you are ready to start working as a fully qualified backend web developer.",
        "registrationLink":"https://codefactory.wien/en/registration-backend-developer-en/" 
    },
    {     
        "id": "4",
        "name": "JavaScript",
        "description": "This course teaches you what the most basic programming concepts are in JavaScript and how to use them. You get to know data types, functions, loops, control flow and objects.",
        "image": "./img/course/js.jpg",
        "price": "290",
        "duration": "1",
        "language": "English",
        "location": "CodeFactory, Kettenbrückengasse 23/2/12, 1050 Vienna",   
        "frontEndTech": 
            ["Javascript"],
        "backEndTech": 
            [],
        "times": "1x per month 9-15 o’clock @ CodeFactory",
        "requirements": "Since this course is aimed at beginners in JavaScript, no specific programming skills are required. Also knowledge about HTML and CSS are not required, but help to visually customize your projects.",
        "registrationLink":"https://codefactory.wien/en/registration-basiskurs-javascript-en/" 
    },
    {     
        "id": "5",
        "name": "Basic Course HTML/CSS",
        "description": "In this course, you will learn the building blocks of HTML and CSS to create and design your first website from scratch.",
        "image": "./img/course/htmlcss.jpg",
        "price": "290",
        "duration": "1",
        "language": "English",
        "location": "CodeFactory, Kettenbrückengasse 23/2/12, 1050 Vienna",   
        "frontEndTech": 
            ["HTML5","CSS3"],
        "backEndTech": 
            [],
        "times": "1x per month 9-15 o’clock @ CodeFactory",
        "requirements": "You should have skills and abilities to download and use a text editor for editing your web pages, we recommend Sublime text or brackets. You can use another text editor if you want, but it should have the ability to highlight code syntax. You should be able to download and install Google Chrome, as we will be exploring this developer’s tools extensively in this course.",
          "registrationLink":"https://codefactory.wien/en/registration-basiskurs-html-css-en/"
    },
    {     
        "id": "6",
        "name": "Java Developer",
        "description": "The CodeFactory Java Developer course prepares you for your versatile career as a Java Junior Developer. You will learn how to use create software in Java, use integrated development environments and apply advanced programming concepts to solve different real-life projects and tasks. As a Java Junior Developer you will have good knowledge in the area of software development and will be proficient in syntax, tools and programming concepts. All of this, including your own impressive project-portfolio built throughout the course, will allow you to immediately start your career in the software development industry. As a generalist, you will be able to work productively and collaborate closely with other disciplines such as project managing, test planning as well as programming activities software and test planning as well as programming activities.",
        "image": "./img/course/java.png",
        "price": "2490",
        "duration": "8",
        "language": "English",
        "location": "CodeFactory, Kettenbrückengasse 23/2/12, 1050 Vienna",   
        "frontEndTech": 
            [],
        "backEndTech": 
            ["Java"],
        "times": "Monday to Thursday 9-16 o’clock @ CodeFactory",
        "requirements": "You are motivated to collaborate and learn in teams and to face new challenges. You have a decent understanding of computer usage and have a good grasp of the English language",
       "registrationLink":"https://codefactory.wien/en/registration-java-en/"
    },
    {     
        "id": "7",
        "name": "Python Programming",
        "description": "In this course, students learn the fundamentals of Python. Python is a very powerful programming language used for a whole multitude of applications. The huge community around this open source language has created quite a number of tools to effectively work with Python, many of those – specifically for data science. So, analyzing data with Python is as easy as it has never been before! In this intense practice-oriented course, you will start from the very beginning, with variables and simple mathematical operations, and quickly build your way up and learn how to handle complex data structures, such as lists, dictionaries, and Pandas DataFrames. You’ll also learn about Python functions and control flow, you will work with files and at the end write a real project by following provided guidelines.",
          "image": "./img/course/python.jpg",
        "price": "450",
        "duration": "1",
        "language": "English",
        "location": "CodeFactory, Kettenbrückengasse 23/2/12, 1050 Vienna",   
        "frontEndTech": 
            [],
        "backEndTech": 
            ["Python"],
        "times": "Monday to Thursday 9-15 o’clock @ CodeFactory",
        "requirements": "The course is very intense, but no prior experience with programming or Python is needed. All you need is your ambitions and motivations. If you do know how to program another language, this course will help you quickly switch to Python.",
        "registrationLink":"https://codefactory.wien/en/python-programming-en/"
         }
]